recept/src/Documents/КоррекцияЦены/КоррекцияЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоррекцияЦены</name>
  <registerRecords>InformationRegister.ЦеныМатериалов</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНаСкладе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

recept/src/InformationRegisters/ЦеныМатериалов/ЦеныМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныМатериалов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/Documents/КоррекцияЦены/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЦеныМатериалов
	Движения.ЦеныМатериалов.Записывать = Истина;
	Движение = Движения.ЦеныМатериалов.Добавить();
	Движение.Период = Дата;
	Движение.Номенклатура = Номенклатура;
	Движение.Цена = Цена;

КонецПроцедуры
